mesh_study_re100/cylinder_medium/system/functions/additionalFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

additionalFields
{
    type            writeRegisteredObject;
    libs            (IOFunctionObjects);

    writeControl     outputTime;
    // writeControl   timeStep;
    // writeInterval  1;

    timeStart       100;
    timeEnd         200;

    objectNames ("U_0");
}


// ************************************************************************* //
