mesh_study_re100/cylinder_medium/system/functions/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type            forces;
    libs            (forces);

    writeControl    timeStep;
    writeInterval    1;

    // Dump to file
    log             yes;
    
    // Sampled patches
    patches         (obstacle);

    // Name of fields
	pName p;
	Uname U;

    // Density
    rho             rhoInf;             // Indicates incompressible
    rhoInf          1.225;              // Required when rho = rhoInf

    // Force calculation constants
    CofR            (0 0 0);            // 2D not used
}


// ************************************************************************* //

